// 가로, 세로 구분 없이
// 둘 중 가장 큰 값과, 가장 작은 값을 순회하면서
// 다른 명함 크기를 수용할 수 있을 정도로는 크면서
// 가장 큰 명함의 크기보다는 작은
// 명함의 크기를 구하기

import java.util.*;

class Solution {
    public int solution(int[][] sizes) {
        int answer = 0;
        int max_v = 0;
        int max_h = 0;
        for(int i = 0; i < sizes.length; i ++){
            // 가로 : 가장 긴 값
            // 60,50 -> 60 50
            // 30,70 -> 70 30
            // 60,30 -> 60 30
            // 80,40 -> 80 40
            int v = Math.max(sizes[i][0], sizes[i][1]);
            // 세로 : 가장 작은 값
            // 60,50 -> 50 60
            // 30,70 -> 30 70
            // 60,30 -> 30 60
            // 80,40 -> 40 80
            int h = Math.min(sizes[i][0], sizes[i][1]);
            // 0,60 -> 60 | 0,50 -> 50
            // 0,50 -> 50 | 0,60 -> 60
            
            // 60,70 -> 70 | 50,30 -> 50
            // 50,30 -> 50 | 60,70 -> 70
            
            // 70,60 -> 70 | 50,30 -> 50
            // 50,30 -> 50 | 70,60 -> 70
            
            // 70,80 -> 80 | 50,40 -> 50
            // 50,40 -> 50 | 70,80 -> 80
            max_v = Math.max(max_v,v);
            max_h = Math.max(max_h,h);
        }
        return answer = max_v * max_h;
    }
}